{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,9],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"Dense","config":{"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden1","trainable":true}},{"class_name":"Dense","config":{"units":25,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden2","trainable":true}},{"class_name":"Dense","config":{"units":9,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"output","trainable":true}}]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null,"weightData":"RcLVQC7Pn0ARJMBAsenXQHj5NkAPFxRAMXYCQYZmg0BXJZ6+JxLgQNArwrxDGag8a2QpP/EIMT89oS8/j8TqPuUW5D7swUg+SCpBvfs3kz2n/hzAP2z3v5A7W78Ouna/a4Z8wKPRcsCCdiC/+TSMwFERyL0xQBHA6rHEP51yAEC6s78/tQF5P+NDZkDHVU5AHxViPw42MUDpGki+rdhMP37WVb9z03e/BTaJv9GCF787Ias9lmT+PZf+AsC6BkK+YTpsvmCoYL+jhwQ/hcMEP4e4Oj9KGUS9AqhvPzzP2j8ziQK/hEe8P8f/Tj73A729xSMEQMaCVkARetI/HceyP+G8fUDLGlNAS7tNP75yXUAXQYK+XlfjP9U28L4CU1Q/RxEJvgY1Nb8ThLc/8WDHPxQKib+7gME/VxqrPJ4Vg74ZCkK/Uf8ov3PRmL/kbNq/DOq2vPQ2fD7otO+/mgOzPVAMLT3cB8C/Q2uqQT0zskH5jKlBtuaoQSbBwEGBxMNBk82gQcV6v0EsPgS/vMqpQcVWXEEfRy89/2hQQWtuGr4HIJm9H/X9vQynKL4ggFtB3gmDvpW8YkGXhk1BRlVFQQFZKT0vPFtBpglZPrI6s7yeg1pBPHWOviqXaEGUAqu+1XRCQTQ4aT146k5BQqBQQSS2TUFvRWtBxIFtPlUDdEEHECg9sVIcuVMJH765v54+PEhwQWL9Sj7m8WZBMiBvQQ0VM0ElEPO9ReByQS18a77W/OC++zRrQT41Cj7YYm9BrdBqvvmuLkEfjdc+DHl/QdXvSkE2a29BFEBKQdKgmb7F01lBwypyvqnBsb1pd68+/uoPvtCaT0GLA+i9MY5OQcIsV0FfM0VBauMwvvzQR0FDH+++yyqvu/XITEHVk+C+DMVTQQfMeb4PwEhBLMSRPTJIO0EKWEVBSnpZQYG9NkFP/FC+QqVLQU8pJr60WOy99tK1vnvrs74x1TlB91dpvkttTkFfW0xBZ+VCQaAfQr58m0BBMscJvkA0qT2kUT9BfHrVvpEEVkGipHO++kVKQXHeo75+4yZBes1CQVUfTkGYO49B8M5jvr1LlkFBi/Q7vLyBvDM9g74WP7A9xkqhQZ8c6T0rhIJBTTyRQe9V4kC+nVC968iNQW+tx75vPfM9Pu+XQX+Str5bp4dBNOvjvUQjBkFWI9W9crW5QVC8OkG6IYpBVaOQQfmCCD2zEplBpkMfvg2uar7DXh6+tbz6voYeoEF8MA+/RHR0QSXijUGL1+FALhZMvq75ikE2Pmw9+w7ivc8nnkHya8e8uhKFQUOCL75LmvxA2VZNvqYNwUFbQkNBW0SQQfSuPEFz+Xi+dtI8QVYNSr5jhAG9F41ZvSwnKz52NCpBUMM/O5GnT0GQ/EJBK+BhQbpuV72HoDVBk99xPZ/Bbb4VVyZB0iLrvXqaVEHN+6A+8NtgQaxJwzyvB/xAIBRMQfbfQEHsi5RB1GbIvvltkEG0S+k9EQ4xvVf32L6IpZa8iPugQcucvr7k8IBBgXKNQXvSB0GZV06+v5eXQZbkQb61pAa/YuKcQcFqwr6IIYtB8umAvggYGEF3Y5W+FCm6QeOHVUHGfIZBqEkovq6SAz7+Xqi+3jZZvoQMmL49k3u+yoKCvS77fj7UdPi9GYuDvYwN3Ty/h5G9AR3NPAE5ur23tyK++uYiPvdoZD16EII+GQF4PtpqSD6IxOs8PM5vPfqLl70gjr+9IETHPiYLUEFKZ58957RSQalie74Bm4K9kzfgPa6VgL7cfVJBdMUOPcmuU0HzNlBB89BEQY84cz327VZB/UAQu1sq5j2qEkpBcDhePojIZ0FDKa27qDNPQVWFEr94PjtBF6FQQdjFUEFGfbZBjI6bvYrGt0EAAAAAOmmSvapu271D9xq+vj3GQYA03r0SvaJB3PazQRDcGUEAAAAAeE21QbiiTLwiFzi9OD7BQQAAAACl4q1B/W6AvYr/MEF4V9m9ioDvQeelhEEe3bBBtMySQShwT0G/s1ZBUWWrQLkb1UDVG6xAOQqfQBk8pUAAlcZA/cRMvpx5sbzK0mc+7ABXPts/ML7AKjU+BWOjvDpNED2gMyY+yZOTQUjxWkHaHlBB8GSjQBwkvEAXobZANY+hQOQvqEAzSclAraXpPWCEq77Yf1E+BkwUPuaarT1o+rA9W6xcvrPfXr1EiCI+ZXNQviP1TD5+4J8+qGYvPhwOtD3H2qy+bOiPPgY7+b54Ess9XD/2PNXsGb6KYri9T9gIPn9Kkz3y6Ue9IcmevkQzsr7o89u7tjUivnBibT4KBus9TUYjvpTsfD7ONpK+bOLbPucJar6MaTm+/CSdQTI8RUHWRkxBm3+mQPlfy0BA1alA2SigQJHuqkAVKM5AQv+1PeGdkL4pDI6+HaAfvi8xYb2Ag9m9M6ArPk/UV753CrQ9h1GGQej4ZUEsN2VBfVikQFRl0EBwHa9AuWGnQDAbq0CxpNZAXjKQQbvAXkG5O1NBLrOrQCW5yUAIGaZAWTGiQBVZokBdX8pAgbQWQc0VlUGZxIRBFSWnQO57z0BK6aFAQQyWQMvDl0AIbclA+B49PrJXrr07T7g9DlwOPsP1oD7lpBa+woQCvc+ufD4iKkM+aZOSQfo4TkEqJFxBFL2wQOFZxkACLLZAojipQAN1oEBLT8FAssM/vtc4Qz7FEd28EoUMPsXeTr4RGB29VvyKvvy7gD7IXBs9qLlNvu8CAzxr4DW+H/1pPsvE+b38gIe+RcNqvIohrD6/CQE9EpeaQXbvR0ECNklBK7y0QO9/yUDS9bpA6d6WQJwirkCiXc5AaehUPrtHxr17Kf09x/BWPshNLT4gGrC+wXW6vOUZpb0MnSs+aS+MQfOCZUElp2RBw6K7QPVl2EDJ37BAFsStQOO5n0D8iNVAUGBKPnh8uj6mJe49+UwLvhmaAD0IV04+XHuLvnFh9T27SiA+P7EoQaxTkUGYKoZB7K6pQF5VykBIXZ5AYsSPQCdmm0DuvstAyNT1vYTmpj2GXII9Xohbvp9qh74m8vs9EE9GPvTrO73koK6+YHmsQfkcGkG+8yNBFJOaQEYxvECLi5hA8VCQQBeqikAOW7lAwTFkQR8hdkGQw25BdX28QJmF0kBG96VAfw2gQO5VoEBkuNJAvd2OQao1Y0EqaFJBOsWzQCPXy0A22rlA9AKlQHyypkBVFM1ApgMOQtqf3EB8mPlAnwbZQC01DUEysxNB/cXaQE3b8kDJwgpB","weightSpecs":[{"name":"hidden1/kernel","shape":[9,10],"dtype":"float32"},{"name":"hidden1/bias","shape":[10],"dtype":"float32"},{"name":"hidden2/kernel","shape":[10,25],"dtype":"float32"},{"name":"hidden2/bias","shape":[25],"dtype":"float32"},{"name":"output/kernel","shape":[25,9],"dtype":"float32"},{"name":"output/bias","shape":[9],"dtype":"float32"}]}