{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,9],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"Dense","config":{"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden1","trainable":true}},{"class_name":"Dense","config":{"units":25,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden2","trainable":true}},{"class_name":"Dense","config":{"units":9,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"output","trainable":true}}]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null,"weightData":"a1rcQKWEpkCquMZA3nXeQGXJRECD8yFAabcFQZBGikBXJZ6+zZ/mQNOPWj667IQ+UR5mP4qjbT9bF24/uvAzP3HXLT9iZ+A+SCpBvdvfnT7gwyTAf3UDwNVWer+z+Iq/1iKCwCeOesC/kT+/yxGQwFERyL27BRnA4ESNP/gIyT+QXIg/06UKP5XgSUBB5TFAa8LpPqLrFEDpGki+SZi8PtknR79XrWm/WcyBv8JWCL9XNAo+cJQzPlk8/r8Xugy+YTpsvlXAUb+24s8+88HOPpBWHj8EaiG+gKtQP3dKyz/y1x2/J/asP8f/Tj792U++17bJP4XsNkDhAZQ/Ew5pP4B/XUC3zDJA5JGlPopdPUAXQYK+7fmkP+73tr5SGnA/3xavvP8kGL/VcMQ/4TjUP3rVc7+tr84/VxqrPJ9PEr5uEmC/iHZHv3/Wp78VY+m/6EAUvgTW/D1+Xf6/iHIMvVAMLT2wBs+/6KemQdFxrkFhyqVBYCSlQVIFvUFqCcBBKgqdQQW9u0EsPgS/8wamQZlQWEEfRy8911dMQWtuGr4HIJm9H/X9vQynKL4Yq1dB3gmDvrGrXkFUc0lBhU1AQQFZKT1uM1dBpglZPrI6s7y0plZBPHWOvlCKZEGUAqu+HKA9QTQ4aT1Ic0tBojxMQcGpSUGjTmZBxIFtPsUGb0EHECg9sVIcuVMJH765v54+g35rQWL9Sj7x02FBRQ9qQXlyLUElEPO9g+htQS18a77W/OC+jGVmQT41Cj6/QGpBrdBqvssYKUEfjdc+r+t6QePLRUHmUWpBIQdGQdKgmb6ZmFVBwypyvqnBsb1pd68+/uoPvuGiS0GLA+i9T0RKQT/iUkGmDUBBauMwvvqWQ0FDH+++yyqvu57ISEHVk+C+kHZPQQfMeb4twUNBLMSRPe+hN0Gy1EBBBC5VQdDxMkFP/FC+jtZHQU8pJr60WOy99tK1vnvrs76pQDZB91dpvpGPSkHXhUhBq/89QaAfQr7ozDxBMscJvkA0qT2DsztBfHrVvjYsUkGipHO+tpJFQXHeo74YvSNBoZM+QY5QSkFkmIxB8M5jvkyrk0FBi/Q7vLyBvDM9g74WP7A97nmeQZ8c6T0R/H9BTKiOQeli1kC+nVC9sCeLQW+tx75vPfM9byqVQX+Str7dJIVBNOvjvWQ9AEFWI9W9DJ62QSUhNUFzmodBw+yNQfmCCD1lYJZBpkMfvg2uar7DXh6+tbz6vsc+nUF8MA+//KJuQXw8i0F/wtVALhZMvlpEiEE2Pmw9+w7ivR5Rm0Hya8e8P3+CQUOCL74qivBA2VZNvkbnvUGSiz1BYaqNQcxfOUFz+Xi+ZYQ5QVYNSr5jhAG9F41ZvSwnKz5lECdBUMM/O7MuTEEzqT9BmTFdQbpuV739TTJBk99xPZ/Bbb7QKSNB0iLrvUw1UUHN+6A+sWhcQaxJwzywvfZAehpIQT+VPUEiPJJB1GbIvlgijkG0S+k9EQ4xvVf32L6IpZa8gW2eQcucvr7i9XxBVTKLQeZNAkGZV06+vEiVQZbkQb61pAa/RWWaQcFqwr4e6ohB8umAvhCdEkF3Y5W+6Em3QaRnUEGfRYRBqEkovq6SAz7+Xqi+3jZZvoQMmL49k3u+yoKCvS77fj7UdPi9GYuDvYwN3Ty/h5G9AR3NPAE5ur23tyK++uYiPvdoZD16EII+GQF4PtpqSD6IxOs8PM5vPfqLl70gjr+9IETHPtBQTEFKZ589H/VOQalie74Bm4K9kzfgPa6VgL6+8E5BdMUOPbPmT0FJc0xBG/s/QY84cz1DMVNB/UAQu1sq5j1BfkZBcDhePp0IZEFDKa27MZZKQVWFEr/bIjhBQHZMQXULTUG9nLJBjI6bvVzps0EAAAAAOmmSvapu271D9xq+3F3CQYA03r27yZ5BpBGwQeV1EUEAAAAAFmqxQbiiTLwiFzi9f2W9QQAAAACJ8qlB/W6AvV6fKEF4V9m9hFnrQb2ggEHg+qxB5UmRQYklR0FBJVBBde2lQGzKzkDASqdAqbGbQBp2n0A8NcBA/cRMvpx5sbzK0mc+7ABXPts/ML7AKjU+BWOjvDpNED2gMyY+yw6SQQmjUkH6i0lBIOmdQMjOtUDFyrFAtTGeQOtkokB15MJAraXpPWCEq77Yf1E+BkwUPuaarT1o+rA9W6xcvrPfXr1EiCI+ZXNQviP1TD5+4J8+qGYvPhwOtD3H2qy+bOiPPgY7+b54Ess9XD/2PNXsGb6KYri9T9gIPn9Kkz3y6Ue9IcmevkQzsr7o89u7tjUivnBibT4KBus9TUYjvpTsfD7ONpK+bOLbPucJar6MaTm+n5GbQV3jPEHruEVBngOhQC4GxUDq+qRApcGcQNUdpUBfwsdAQv+1PeGdkL4pDI6+HaAfvi8xYb2Ag9m9M6ArPk/UV753CrQ9IuiEQfrFXUHaoF5BcOOeQM4dykCRUqpA+BekQHRdpUCOT9BA7rSOQS16VkEyqExBpDumQMZow0AYR6FAbdmeQC2TnEAaAcRAArMUQYAAkUFmQoFBMeehQMJ+yUArXJ1AkB2TQA1MkkDoZMNA+B49PrJXrr07T7g9DlwOPsP1oD7lpBa+woQCvc+ufD4iKkM+oBKRQWbuRUEMl1VBFUWrQJIKwEBFW7FAn+ClQOCsmkCN8LpAssM/vtc4Qz7FEd28EoUMPsXeTr4RGB29VvyKvvy7gD7IXBs9qLlNvu8CAzxr4DW+H/1pPsvE+b38gIe+RcNqvIohrD6/CQE9DgiZQWuaP0H1qEJB30GvQOkpw0AOILZAMn2TQKFWqEAx/MdAaehUPrtHxr17Kf09x/BWPshNLT4gGrC+wXW6vOUZpb0MnSs+kr+KQcNHXUEcD15BDiW2QKIU0kBVDaxAMHGqQMnymUB0Ks9AUGBKPnh8uj6mJe49+UwLvhmaAD0IV04+XHuLvnFh9T27SiA+n5EmQUM5jUH7qYJB7WmkQMZOxEBXyJlAQMWMQCbjlUAEqMVAyNT1vYTmpj2GXII9Xohbvp9qh74m8vs9EE9GPvTrO73koK6++rqqQWqgEUHrbR1BnhGVQJ/PtUCDrZNAr9WMQKfLhECq67JAdadhQcUMbkH1MWhBayC3QEVZzEBqQ6FAaeacQK+ymkDEgMxAZmKNQVzxWkFB0ktBHE2uQMyIxUCICrVAoK2hQIzuoEA7uMZArmwLQpHKxEDGbuVAWezOQKFyB0HHqQ5BNoDSQGxy6EBx6ARB","weightSpecs":[{"name":"hidden1/kernel","shape":[9,10],"dtype":"float32"},{"name":"hidden1/bias","shape":[10],"dtype":"float32"},{"name":"hidden2/kernel","shape":[10,25],"dtype":"float32"},{"name":"hidden2/bias","shape":[25],"dtype":"float32"},{"name":"output/kernel","shape":[25,9],"dtype":"float32"},{"name":"output/bias","shape":[9],"dtype":"float32"}]}